subhra-g/mspm0-sdk/source/third_party/tinyusb/hw/mcu/ti/mspm0/ti/devices/msp/peripherals/m0p/sysctl/hw_sysctl_mspm0c511x.h
/* SYSCTL_EXRSTPIN Bits */
/* SYSCTL_EXRSTPIN[KEY] Bits */
#define SYSCTL_EXRSTPIN_KEY_OFS                  (24)                            /* !< KEY Offset */
#define SYSCTL_EXRSTPIN_KEY_MASK                 ((uint32_t)0xFF000000U)         /* !< The key value 1Eh must be written
                                                                                    together with DISABLE to disable the
                                                                                    reset function. */
#define SYSCTL_EXRSTPIN_KEY_VALUE                ((uint32_t)0x1E000000U)         /* !< Issue command */
/* SYSCTL_EXRSTPIN[DISABLE] Bits */
#define SYSCTL_EXRSTPIN_DISABLE_OFS              (0)                             /* !< DISABLE Offset */
#define SYSCTL_EXRSTPIN_DISABLE_MASK             ((uint32_t)0x00000001U)         /* !< Set DISABLE to disable the reset
                                                                                    function of the NRST pin.  Once set,
                                                                                    this configuration is locked until
                                                                                    the next POR. */
#define SYSCTL_EXRSTPIN_DISABLE_FALSE            ((uint32_t)0x00000000U)         /* !< Reset function of NRST pin is
                                                                                    enabled */
#define SYSCTL_EXRSTPIN_DISABLE_TRUE             ((uint32_t)0x00000001U)         /* !< Reset function of NRST pin is
                                                                                    disabled */

/* SYSCTL_SYSSTATUSCLR Bits */
/* SYSCTL_SYSSTATUSCLR[KEY] Bits */
#define SYSCTL_SYSSTATUSCLR_KEY_OFS              (24)                            /* !< KEY Offset */
#define SYSCTL_SYSSTATUSCLR_KEY_MASK             ((uint32_t)0xFF000000U)         /* !< The key value CEh (206) must be
                                                                                    written to KEY together with ALLECC
                                                                                    to clear the ECC state. */
#define SYSCTL_SYSSTATUSCLR_KEY_VALUE            ((uint32_t)0xCE000000U)         /* !< Issue command */
/* SYSCTL_SYSSTATUSCLR[ALLECC] Bits */
#define SYSCTL_SYSSTATUSCLR_ALLECC_OFS           (0)                             /* !< ALLECC Offset */
#define SYSCTL_SYSSTATUSCLR_ALLECC_MASK          ((uint32_t)0x00000001U)         /* !< Set ALLECC to clear all ECC related
                                                                                    SYSSTATUS indicators. */
#define SYSCTL_SYSSTATUSCLR_ALLECC_CLEAR         ((uint32_t)0x00000001U)         /* !< Clear ECC error state */

/* SYSCTL_SWDCFG Bits */
/* SYSCTL_SWDCFG[KEY] Bits */
#define SYSCTL_SWDCFG_KEY_OFS                    (24)                            /* !< KEY Offset */
#define SYSCTL_SWDCFG_KEY_MASK                   ((uint32_t)0xFF000000U)         /* !< The key value 62h (98) must be
                                                                                    written to KEY together with DISBALE
                                                                                    to disable the SWD functions. */
#define SYSCTL_SWDCFG_KEY_VALUE                  ((uint32_t)0x62000000U)         /* !< Issue command */
/* SYSCTL_SWDCFG[DISABLE] Bits */
#define SYSCTL_SWDCFG_DISABLE_OFS                (0)                             /* !< DISABLE Offset */
#define SYSCTL_SWDCFG_DISABLE_MASK               ((uint32_t)0x00000001U)         /* !< Set DISABLE to disable the SWD
                                                                                    function on SWD pins, allowing the
                                                                                    SWD pins to be used as GPIO. */
#define SYSCTL_SWDCFG_DISABLE_TRUE               ((uint32_t)0x00000001U)         /* !< Disable SWD function on SWD pins */

/* SYSCTL_FCCCMD Bits */
/* SYSCTL_FCCCMD[KEY] Bits */
#define SYSCTL_FCCCMD_KEY_OFS                    (24)                            /* !< KEY Offset */
#define SYSCTL_FCCCMD_KEY_MASK                   ((uint32_t)0xFF000000U)         /* !< The key value 0Eh (14) must be
                                                                                    written with GO to start a capture. */
#define SYSCTL_FCCCMD_KEY_VALUE                  ((uint32_t)0x0E000000U)         /* !< Issue command */
/* SYSCTL_FCCCMD[GO] Bits */
#define SYSCTL_FCCCMD_GO_OFS                     (0)                             /* !< GO Offset */
#define SYSCTL_FCCCMD_GO_MASK                    ((uint32_t)0x00000001U)         /* !< Set GO to start a capture with the
                                                                                    frequency clock counter (FCC). */
#define SYSCTL_FCCCMD_GO_TRUE                    ((uint32_t)0x00000001U)

/* SYSCTL_USBFLLCTL Bits */
/* SYSCTL_USBFLLCTL[FLLEN] Bits */
#define SYSCTL_USBFLLCTL_FLLEN_OFS               (1)                             /* !< FLLEN Offset */
#define SYSCTL_USBFLLCTL_FLLEN_MASK              ((uint32_t)0x00000002U)         /* !< USB Oscillator Frequeny Lock Loop
                                                                                    Enable */
#define SYSCTL_USBFLLCTL_FLLEN_FALSE             ((uint32_t)0x00000000U)         /* !< USB CLK Frequeny Lock Loop is
                                                                                    disabled */
#define SYSCTL_USBFLLCTL_FLLEN_TRUE              ((uint32_t)0x00000002U)         /* !< USB CLK Frequeny Lock Loop is
                                                                                    enabled */
/* SYSCTL_USBFLLCTL[REFSEL] Bits */
#define SYSCTL_USBFLLCTL_REFSEL_OFS              (8)                             /* !< REFSEL Offset */
#define SYSCTL_USBFLLCTL_REFSEL_MASK             ((uint32_t)0x00000100U)         /* !< Reference Clock Selection for
                                                                                    Frequency Lock Loop */
#define SYSCTL_USBFLLCTL_REFSEL_USBSOF           ((uint32_t)0x00000000U)         /* !< Use USB Start-Of-Frame as Reference
                                                                                    Clock */
#define SYSCTL_USBFLLCTL_REFSEL_LFCLK            ((uint32_t)0x00000100U)         /* !< Use LFCLK as Reference Clock */
/* SYSCTL_USBFLLCTL[CLKEN] Bits */
#define SYSCTL_USBFLLCTL_CLKEN_OFS               (0)                             /* !< CLKEN Offset */
#define SYSCTL_USBFLLCTL_CLKEN_MASK              ((uint32_t)0x00000001U)         /* !< USB Oscillator Enable */
#define SYSCTL_USBFLLCTL_CLKEN_FALSE             ((uint32_t)0x00000000U)         /* !< USB CLK is disabled */
#define SYSCTL_USBFLLCTL_CLKEN_TRUE              ((uint32_t)0x00000001U)         /* !< USB CLK is enabled */

/* SYSCTL_USBFLLADJ Bits */
/* SYSCTL_USBFLLADJ[FRQMOD] Bits */
#define SYSCTL_USBFLLADJ_FRQMOD_OFS              (8)                             /* !< FRQMOD Offset */
#define SYSCTL_USBFLLADJ_FRQMOD_MASK             ((uint32_t)0x00000700U)         /* !< Frequency Lock Loop Modulator Value */
/* SYSCTL_USBFLLADJ[FRQADJ] Bits */
#define SYSCTL_USBFLLADJ_FRQADJ_OFS              (0)                             /* !< FRQADJ Offset */
#define SYSCTL_USBFLLADJ_FRQADJ_MASK             ((uint32_t)0x0000003FU)         /* !< Frequency Lock Loop Adjust */

/* SYSCTL_USBFLLSTAT Bits */
/* SYSCTL_USBFLLSTAT[FRQMOD] Bits */
#define SYSCTL_USBFLLSTAT_FRQMOD_OFS             (24)                            /* !< FRQMOD Offset */
#define SYSCTL_USBFLLSTAT_FRQMOD_MASK            ((uint32_t)0x07000000U)         /* !< Current Frequency Lock Loop
                                                                                    Modulator Value */
/* SYSCTL_USBFLLSTAT[REFRDY] Bits */
#define SYSCTL_USBFLLSTAT_REFRDY_OFS             (8)                             /* !< REFRDY Offset */
#define SYSCTL_USBFLLSTAT_REFRDY_MASK            ((uint32_t)0x00000100U)         /* !< Reference Clock for Frequency Lock
                                                                                    Loop ready indication */
#define SYSCTL_USBFLLSTAT_REFRDY_FALSE           ((uint32_t)0x00000000U)         /* !< USB FLL Reference clock is not
                                                                                    ready */
#define SYSCTL_USBFLLSTAT_REFRDY_TRUE            ((uint32_t)0x00000100U)         /* !< USB FLL Reference clock is ready */
/* SYSCTL_USBFLLSTAT[FLLLOCK] Bits */
#define SYSCTL_USBFLLSTAT_FLLLOCK_OFS            (1)                             /* !< FLLLOCK Offset */
#define SYSCTL_USBFLLSTAT_FLLLOCK_MASK           ((uint32_t)0x00000002U)         /* !< USB Oscillator Frequeny Lock Loop
                                                                                    Lock Indication */
#define SYSCTL_USBFLLSTAT_FLLLOCK_FALSE          ((uint32_t)0x00000000U)         /* !< USB CLK Frequeny Lock Loop is not
                                                                                    locked */
#define SYSCTL_USBFLLSTAT_FLLLOCK_TRUE           ((uint32_t)0x00000002U)         /* !< USB CLK Frequeny Lock Loop is
                                                                                    locked */
/* SYSCTL_USBFLLSTAT[CLKRDY] Bits */
#define SYSCTL_USBFLLSTAT_CLKRDY_OFS             (0)                             /* !< CLKRDY Offset */
#define SYSCTL_USBFLLSTAT_CLKRDY_MASK            ((uint32_t)0x00000001U)         /* !< USB Oscillator Ready Indication */
#define SYSCTL_USBFLLSTAT_CLKRDY_FALSE           ((uint32_t)0x00000000U)         /* !< USB CLK is not ready */
#define SYSCTL_USBFLLSTAT_CLKRDY_TRUE            ((uint32_t)0x00000001U)         /* !< USB CLK is ready */
/* SYSCTL_USBFLLSTAT[FRQADJ] Bits */
#define SYSCTL_USBFLLSTAT_FRQADJ_OFS             (16)                            /* !< FRQADJ Offset */
#define SYSCTL_USBFLLSTAT_FRQADJ_MASK            ((uint32_t)0x003F0000U)         /* !< Current Frequency Lock Loop Adjust */

/* SYSCTL_SHUTDNSTORE0 Bits */
/* SYSCTL_SHUTDNSTORE0[DATA] Bits */
#define SYSCTL_SHUTDNSTORE0_DATA_OFS             (0)                             /* !< DATA Offset */
#define SYSCTL_SHUTDNSTORE0_DATA_MASK            ((uint32_t)0x000000FFU)         /* !< Shutdown storage byte 0 */

/* SYSCTL_SHUTDNSTORE1 Bits */
/* SYSCTL_SHUTDNSTORE1[DATA] Bits */
#define SYSCTL_SHUTDNSTORE1_DATA_OFS             (0)                             /* !< DATA Offset */
#define SYSCTL_SHUTDNSTORE1_DATA_MASK            ((uint32_t)0x000000FFU)         /* !< Shutdown storage byte 1 */

/* SYSCTL_SHUTDNSTORE2 Bits */
/* SYSCTL_SHUTDNSTORE2[DATA] Bits */
#define SYSCTL_SHUTDNSTORE2_DATA_OFS             (0)                             /* !< DATA Offset */
#define SYSCTL_SHUTDNSTORE2_DATA_MASK            ((uint32_t)0x000000FFU)         /* !< Shutdown storage byte 2 */

/* SYSCTL_SHUTDNSTORE3 Bits */
/* SYSCTL_SHUTDNSTORE3[DATA] Bits */
#define SYSCTL_SHUTDNSTORE3_DATA_OFS             (0)                             /* !< DATA Offset */
#define SYSCTL_SHUTDNSTORE3_DATA_MASK            ((uint32_t)0x000000FFU)         /* !< Shutdown storage byte 3 */


#ifdef __cplusplus
}
#endif

#endif /* ti_devices_msp_peripherals_hw_sysctl_mspm0c511x__include */
